# http://codecombat.com/play/level/burls-beets-booleans
# Булев тип принимает значения True или False
# Символ == означает "это равно тому?"
# Так, строка "А == B" задает вопрос "A равняется B?"
# Ответ должен быть булевым значением!
# Нажмите кнопку "Помощь", если Вы запутались!

# Вопрос: 2 == 3
# Произнесите правильный ответ:
hero.say(False)

# Вопрос: 3 == 3
# Ответьте ложь или истина на вопрос 2:
hero.say(True)

# Вопрос: "Three" == 3
# Ответьте ложь или истина на вопрос 3:
hero.say(False)

# Вопрос: "Three" == "Three"
# Ответьте ложь или истина на вопрос 4:
hero.say(True)

# Вопрос: 1 + 2 == 3
# Ответьте ложь или истина на вопрос 5:
hero.say(True)
