//https://codecombat.com/play/level/javascript-stillness-in-motion
// Вы можете вложить один оператор if  в другой оператор if.
// Однако, используя эту хитрость, Вы должны быть внимательны к тому, как операторы if взаимодействуют друг с другом.
// Полезно начать с одного внешнего оператора if,
// используя комментарии в качестве "заполнителя" для внутреннего оператора if/else:

while(true) {
    var enemy = hero.findNearestEnemy();
    // Если рядом есть враг, то...
    if(enemy) {
        // Создайте переменную для значения дистанции (с помощью DistanceTo)
        var distance = hero.distanceTo(enemy);
        // Если до врага меньше 5 метров, то атаковать (attack)
        if(distance&&distance < 5){
            hero.attack(enemy);
        }
        else{
            hero.shield();
        }
        // В противном случае (если враг далеко), использовать щит (shield)

    // Иначе (если нет врагов)
    } else {
        // тогда двигаться обратно к Х
        hero.moveXY(40, 34);
    }
}
